export const baseMap = {
    dataset: {
        source: [
            // ['v1', 'v2', 'product'],
            // [670.0, 207.0, '2018/9/27'],
            // [861.5, 235.0, '2018/10/2'],
            // [857.5, 303.5, '2018/10/8'],
            // [843.5, null, '2018/10/17'],
            // [898.5, 350.0, '2018/10/23'],
            // [934.5, 334.0, '2018/10/30'],
            // [962.5, 333.5, '2018/11/10'],
            // [992.0, 370.5, '2018/11/15'],
            // [993.5, null, '2018/11/21'],
            // [null, 360.5, '2018/11/22'],
            // [999.0, 418.0, '2018/11/27'],
            // [1015.5, 429.0, '2018/12/7'],
            // [1025.5, 445.0, '2018/12/11'],
            // [1043.0, 455.5, '2018/12/21'],
            // [1069.0, 453.0, '2018/12/27'],
            // [1083.0, 457.0, '2019/1/2'],
            // [1098.5, 463.0, '2019/1/9'],
            // [null, 464.5, '2019/1/16'],
            // [null, 478.0, '2019/1/21'],
            // [null, 482.0, '2019/2/15'],
            // [null, 498.0, '2019/2/19'],
            // [null, 504.5, '2019/2/28'],
        ]
    },
    title: {
        text: '测点数据'
    },
    toolbox: {
        feature: {
            saveAsImage: {}
        }
    },
    tooltip: {
        trigger: 'axis'
    },
    legend: {
        // data: ['DC2-1', 'DC3-2']
        data: []
    },
    grid: {
        width: '80%',
        height: '80%',
    },
    xAxis: {
        type: 'category',
        boundaryGap: false,
    },
    yAxis: {
        type: 'value',
        axisLabel: {
            formatter: '{value}mm'
        }
    },
    series: [
        // {
        //     name: 'DC2-1',
        //     type: 'line',
        //     encode: {
        //         // 将 "amount" 列映射到 X 轴。
        //         x: 'product',
        //         // 将 "product" 列映射到 Y 轴。
        //         y: 'v1'
        //     },
        //     connectNulls:true
        // },
        // {
        //     name: 'DC3-2',
        //     type: 'line',
        //     encode: {
        //         // 将 "amount" 列映射到 X 轴。
        //         x: 'product',
        //         // 将 "product" 列映射到 Y 轴。
        //         y: 'v2'
        //     },
        //     connectNulls:true
        // }
    ]
};